import { parseSongData } from '@marure/parser'
import YAML from 'yaml'

export default parseSongData(YAML.parse(`
schema: v1
youtube: SX_ViT4Ra7k
title: Lemon
artists:
  - 米津玄師
tags:
  - J-POP
dateLyricsUpdated: '2024-06-12'
lrc: |-
  [00:00.00] < 展示用歌詞樣本 >
  [00:02.40] {夢}(ゆめ)ならばどれほどよかったでしょう
  [00:07.62] {未}(いま)だにあなたのことを{夢}(ゆめ)にみる
  [00:13.20] {忘}(わす)れた{物}(もの)を{取}(と)りに{帰}(かえ)るように
  [00:18.68] {古}(ふる)びた{思}(おも)い{出}(で)の{埃}(ほこり)を{払}(はら)う
  [00:26.92] {戻}(もど)らない{幸}(しあわ)せがあることを
  [00:32.40] {最後}(さいご)にあなたが{教}(おし)えてくれた
  [00:37.90] {言}(い)えずに{隠}(かく)してた{昏}(くら)い{過去}(かこ)も
  [00:43.52] あなたがいなきゃ{永遠}(えいえん)に{昏}(くら)いまま
  [00:49.25] きっともうこれ{以上}(いじょう) {傷}(きず)つくことなど
  [00:54.82] ありはしないとわかっている
  [00:59.90] あの{日}(ひ)の{悲}(かな)しみさえ あの{日}(ひ)の{苦}(くる)しみさえ
  [01:05.32] そのすべてを{愛}(あい)してた あなたとともに
  [01:10.80] {胸}(むね)に{残}(のこ)り{離}(はな)れない {苦}(にが)い{レモン}(れもん)の{匂}(にお)い
  [01:16.60] {雨}(あめ)が{降}(ふ)り{止}(や)むまでは{帰}(かえ)れない
  [01:22.15] {今}(いま)でもあなたはわたしの{光}(ひかり)
  [01:30.00] < 展示用歌詞樣本到此為止、版權歸發行公司所有 >
notes:
  - 本歌詞樣本僅用於展示 App 之功能，版權歸發行公司所有。
credits:
  lyrics: >-
    https://web.archive.org/web/20240612224459/https://www.jpmarumaru.com/tw/JPSongPlay-11243.html
`))
